Tekla Open API Reference for Tekla Structures 2025
CustomPart Constructor
Overload List
Name | Description
CustomPart()
 Creates a new custom part instance.
CustomPart(Point, Point)
 Creates a new custom part instance with the given input.
Top
See Also
Reference
CustomPart Class
Tekla.Structures.Model Namespace